NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05a_application_peripherals.h
/*Trace and debug control*/
#define TAD_PRESENT 1
#define TAD_COUNT 1

#define TAD_TADFORCEON 0                             /*!< (unspecified)                                                        */
#define TAD_TAD_HAS_TASKS 0                          /*!< (unspecified)                                                        */
#define TAD_PDREQCLR 1                               /*!< (unspecified)                                                        */
#define TAD_TAD_HAS_DBGWAKEUPREQ 1                   /*!< (unspecified)                                                        */
#define TAD_TAD_HAS_TWO_TPIUS 0                      /*!< (unspecified)                                                        */
#define TAD_HAS_ENABLE_REG 0                         /*!< (unspecified)                                                        */
#define TAD_HAS_TRACEPORTSPEED_REG 0                 /*!< (unspecified)                                                        */

/*Timer/Counter*/
#define TIMER_PRESENT 1
#define TIMER_COUNT 3

#define TIMER00_CC_NUM_MIN 0                         /*!< (unspecified)                                                        */
#define TIMER00_CC_NUM_MAX 5                         /*!< (unspecified)                                                        */
#define TIMER00_CC_NUM_SIZE 6                        /*!< (unspecified)                                                        */
#define TIMER00_MAX_SIZE_MIN 0                       /*!< (unspecified)                                                        */
#define TIMER00_MAX_SIZE_MAX 31                      /*!< (unspecified)                                                        */
#define TIMER00_MAX_SIZE_SIZE 32                     /*!< (unspecified)                                                        */
#define TIMER00_PCLK_MHZ 128                         /*!< Peripheral clock frequency (PCLK) is 128 MHz                         */
#define TIMER00_PCLK_VARIABLE 1                      /*!< The system is able to configure the TIMER peripheral input clock
                                                          frequency (PCLK) before it reaches TIMER, and calculations of
                                                          PRESCALER value must take the actual PCLK frequency into account*/
#define TIMER00_SHUTDOWN_TASK 0                      /*!< (unspecified)                                                        */

#define TIMER10_CC_NUM_MIN 0                         /*!< (unspecified)                                                        */
#define TIMER10_CC_NUM_MAX 7                         /*!< (unspecified)                                                        */
#define TIMER10_CC_NUM_SIZE 8                        /*!< (unspecified)                                                        */
#define TIMER10_MAX_SIZE_MIN 0                       /*!< (unspecified)                                                        */
#define TIMER10_MAX_SIZE_MAX 31                      /*!< (unspecified)                                                        */
#define TIMER10_MAX_SIZE_SIZE 32                     /*!< (unspecified)                                                        */
#define TIMER10_PCLK_MHZ 32                          /*!< Peripheral clock frequency (PCLK) is 32 MHz                          */
#define TIMER10_PCLK_VARIABLE 0                      /*!< (unspecified)                                                        */
#define TIMER10_SHUTDOWN_TASK 0                      /*!< (unspecified)                                                        */

#define TIMER20_CC_NUM_MIN 0                         /*!< (unspecified)                                                        */
#define TIMER20_CC_NUM_MAX 5                         /*!< (unspecified)                                                        */
#define TIMER20_CC_NUM_SIZE 6                        /*!< (unspecified)                                                        */
#define TIMER20_MAX_SIZE_MIN 0                       /*!< (unspecified)                                                        */
#define TIMER20_MAX_SIZE_MAX 31                      /*!< (unspecified)                                                        */
#define TIMER20_MAX_SIZE_SIZE 32                     /*!< (unspecified)                                                        */
#define TIMER20_PCLK_MHZ 16                          /*!< Peripheral clock frequency (PCLK) is 16 MHz                          */
#define TIMER20_PCLK_VARIABLE 0                      /*!< (unspecified)                                                        */
#define TIMER20_SHUTDOWN_TASK 0                      /*!< (unspecified)                                                        */

/*Event generator unit*/
#define EGU_PRESENT 1
#define EGU_COUNT 3

#define EGU00_PEND 0                                 /*!< (unspecified)                                                        */
#define EGU00_CH_NUM_MIN 0                           /*!< (unspecified)                                                        */
#define EGU00_CH_NUM_MAX 5                           /*!< (unspecified)                                                        */
#define EGU00_CH_NUM_SIZE 6                          /*!< (unspecified)                                                        */

#define EGU10_PEND 0                                 /*!< (unspecified)                                                        */
#define EGU10_CH_NUM_MIN 0                           /*!< (unspecified)                                                        */
#define EGU10_CH_NUM_MAX 15                          /*!< (unspecified)                                                        */
#define EGU10_CH_NUM_SIZE 16                         /*!< (unspecified)                                                        */

#define EGU20_PEND 0                                 /*!< (unspecified)                                                        */
#define EGU20_CH_NUM_MIN 0                           /*!< (unspecified)                                                        */
#define EGU20_CH_NUM_MAX 5                           /*!< (unspecified)                                                        */
#define EGU20_CH_NUM_SIZE 6                          /*!< (unspecified)                                                        */

/*CRACEN TRNG*/
#define CRACEN_PRESENT 1
#define CRACEN_COUNT 1

/*CRACENCORE*/
#define CRACENCORE_PRESENT 1
#define CRACENCORE_COUNT 1

#define CRACENCORE_CRYPTMSTRDMAREGS 0                /*!< (unspecified)                                                        */
#define CRACENCORE_CRYPTMSTRHWREGS 0                 /*!< (unspecified)                                                        */
#define CRACENCORE_RNGCONTROLREGS 1                  /*!< RNGCONTROL registers included                                        */
#define CRACENCORE_PKREGS 0                          /*!< (unspecified)                                                        */
#define CRACENCORE_IKGREGS 0                         /*!< (unspecified)                                                        */
#define CRACENCORE_RNGDATAREGS 0                     /*!< (unspecified)                                                        */
#define CRACENCORE_EXTPRIVKEYSREGS 0                 /*!< (unspecified)                                                        */
#define CRACENCORE_LITESMALLRESETVALUES 0            /*!< (unspecified)                                                        */
#define CRACENCORE_LITEMEDIUMRESETVALUES 0           /*!< (unspecified)                                                        */
#define CRACENCORE_FULLRESETVALUES 0                 /*!< (unspecified)                                                        */
#define CRACENCORE_CRACENRESETVALUES 0               /*!< (unspecified)                                                        */
#define CRACENCORE_SHA3RESETVALUES 0                 /*!< (unspecified)                                                        */
#define CRACENCORE_AESRESETVALUES 0                  /*!< (unspecified)                                                        */

/*2.4 GHz radio*/
#define RADIO_PRESENT 1
#define RADIO_COUNT 1

#define RADIO_IRQ_COUNT 2
#define RADIO_WHITENINGPOLY 1                        /*!< (unspecified)                                                        */
#define RADIO_IEEE802154 0                           /*!< (unspecified)                                                        */
#define RADIO_LONGRANGE 0                            /*!< (unspecified)                                                        */
#define RADIO_DIRECTIONFINDING 0                     /*!< (unspecified)                                                        */
#define RADIO_CHANNELSOUNDING 0                      /*!< (unspecified)                                                        */
#define RADIO_ADPLLCOMPANION_INCLUDE_DMA 0           /*!< (unspecified)                                                        */

/*Serial Peripheral Interface Master with EasyDMA*/
#define SPIM_PRESENT 1
#define SPIM_COUNT 3

